# Берем официальный образ Node.js на базе Alpine (очень легкий дистрибутив Linux)
FROM node:20-alpine

# Создаем и переходим в рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы с зависимостями в первую очередь
# Мы копируем package.json и package-lock.json (или yarn.lock) отдельно от остального кода
# Это позволяет Docker использовать кеш для слоя с зависимостями, если они не менялись
COPY package*.json ./

# Устанавливаем все зависимости
RUN npm ci
# Флаг --only=production устанавливает только зависимости, необходимые для запуска (Для PRODUCTION)
# Команда 'npm ci' предпочтительнее 'npm install' для CI/CD и Docker, т.к. она строго следует lock-файлу

# Копируем ВЕСЬ исходный код проекта в рабочую директорию контейнера
COPY . .

# Компилируем TypeScript в JavaScript (создается папка 'dist')
RUN npm run build

# Указываем порт, который будет слушать контейнер
EXPOSE 3000

# Команда для запуска приложения при старте контейнера
# CMD ["node", "dist/main"] # (Для PRODUCTION)
CMD ["npm", "run", "start:dev"]